---
type: ElementDesignOptionFilter
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# ElementDesignOptionFilter

`Autodesk.Revit.DB.ElementDesignOptionFilter` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ElementDesignOptionFilter | — | `` |
| Method | PassesFilter | — | `` |
| Property | DesignOptionId | 2011 | `public ElementId DesignOptionId { get ; }` |